import * as Knex from 'knex';

export async function seed(knex: Knex): Promise<void> {
  await knex('services').del();

  await knex('services').insert([
    {
      id: 1,
      title: 'Консультация хирурга',
      description:
        'Своевременное обращение к хорошему врачу-хирургу, точная диагностика и квалифицированное лечение в медицинском центре помогут избежать возможных осложнений. ',
      scheduleId: 4,
    },
    {
      id: 2,
      title: 'Консультация невропатолога',
      description:
        'Консультация невролога требуется после перенесенного инсульта, при нарушениях мозгового кровообращения, при невритах и невралгиях. Также этот врач может участвовать в лечении болезней прочих систем организма совместно с другими специалистами. Например, в паре с ортопедом при лечении артроза позвоночника или вместе с онкологом при лечении опухоли головного мозга.',
      scheduleId: 5,
    },
    {
      id: 3,
      title: 'Консультация терапевта',
      description:
        'Поводом для обращения к терапевту являются любые жалобы со стороны внутренних органов, в том числе на плохое самочувствие, общую слабость, повышение температуры тела, снижение массы тела и т. д., причина которых не ясна. Терапевт систематизирует все Ваши симптомы, определит основное заболевание, сопутствующие и при необходимости направит на консультацию к специалистам.',
      scheduleId: 6,
    },
  ]);
}
